app/views/admin/index.html.erb

SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (event_date::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC' AS date_trunc_day_event_date_timestamptz_at_time_zone_etc_utc_at_t FROM "behaviors" WHERE (event_date IS NOT NULL) GROUP BY (DATE_TRUNC('day', (event_date::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC'
---
                            <div id=""></div>
                            <%= line_chart Behavior.group_by_day(:event_date).count %>