app/views/behaviors/_form2.html.erb

SELECT "students".* FROM "students"
---
                                            <label>Select Student:</label>
                                            <%= form.select :student_id, Student.all.collect { |s| [s.full_name_last, s.id] }, {}, {required: 'true', autofocus: 'false', class: 'form-control'} %>

SELECT "staffs".* FROM "staffs"
---
                                            <%= form.label :"Reffering staff: " %>
                                            <%= form.select :staff_id, Staff.all.collect { |s| [s.full_name_last, s.id] }, {}, {required: 'true', autofocus: 'false', class: 'form-control'} %>