app/views/behaviors/_form.html.erb

SELECT "students".* FROM "students"
---
        <%= form.label :"Select Student: " %>
        <%= form.select :student_id, Student.all.collect { |s| [s.full_name_last, s.id] }, include_blank: true %>

SELECT "staffs".* FROM "staffs" ORDER BY "staffs"."lName" ASC
---
        <%= form.label :"Reffering staff: " %>
        <%=  form.collection_select :staff_id, Staff.order(:lName), :id, :full_name_last, include_blank: true%>