app/views/behaviors/_form.html.erb

                                            <label>Select Student:</label>
                                            <%= form.select :student_name, Student.all.collect { |s| [s.full_name_last, s.full_name_last] }, {}, {required: 'true', autofocus: 'false', class: 'form-control selectpicker'} %>
---
SELECT "students".* FROM "students"

                                            <%= form.label :"Referring staff: " %>
                                            <%= form.select :staff_name, Staff.all.collect { |s| [s.full_name_last, s.full_name_last] }, {}, {required: 'true', autofocus: 'false', class: 'form-control'} %>
---
SELECT "staffs".* FROM "staffs"