app/controllers/admin_controller.rb

  def index
  	@students = Student.all
  	@behavior = Behavior.all
  	#@recentEvents = Behavior.order(:event_date, :event_time).where(event_date: 1.week.ago..Date.today).limit(10)
    @recentEvents = Behavior.order("event_date DESC", "event_time DESC").where(event_date: 1.week.ago..Date.today).limit(10)

  	@eventsByDay = Behavior.group_by_day(:event_date).count
---
SELECT COUNT(*) AS count_all, (DATE_TRUNC('hour', (event_time::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC' AS date_trunc_hour_event_time_timestamptz_at_time_zone_etc_utc_at_ FROM "behaviors" WHERE (event_time IS NOT NULL) GROUP BY (DATE_TRUNC('hour', (event_time::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC'