app/controllers/behaviors_controller.rb

SELECT "behaviors".* FROM "behaviors"
---
  def index
		@behavior = Behavior.all

SELECT  "behaviors".* FROM "behaviors" WHERE "behaviors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@behavior = Behavior.find(params[:id])

SELECT  "behaviors".* FROM "behaviors" WHERE "behaviors"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
	def edit
		@behavior = Behavior.find(params[:id])

INSERT INTO "behaviors" ("student_id", "event_date", "event_time", "staff_id", "motivation", "peers_involved", "antecedent", "behavior_description", "due_process", "created_at", "updated_at", "minor_other", "major_other", "get_peer_attention", "get_adult_attention", "get_items_activities", "avoid_task", "avoid_peer", "avoid_adult", "minor_language", "minor_contact", "minor_defiance", "minor_disruption", "minor_property", "minor_dress", "minor_technology", "minor_tardy", "major_language", "major_aggression", "major_disrespect", "major_habitual_disruption", "major_dishonesty", "major_harrassment", "major_tardies", "major_vandalism", "major_theft", "major_dress_code", "major_drugs", "major_weapons", "admin_time_office", "admin_loss_privilege", "admin_conference_student", "admin_parent_contact", "admin_detention", "admin_service", "admin_individual_instruction", "admin_counselor", "admin_in_school_suspension", "admin_suspension", "admin_expulsion", "admin_other") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51) RETURNING "id"
---
	def create
		@behavior = Behavior.new(behavior_params)

		if @behavior.save

SELECT  "behaviors".* FROM "behaviors" WHERE "behaviors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "behaviors" SET "peers_involved" = $1, "staff_id" = $2, "get_peer_attention" = $3, "get_adult_attention" = $4, "get_items_activities" = $5, "avoid_task" = $6, "avoid_peer" = $7, "avoid_adult" = $8, "motivation" = $9, "minor_language" = $10, "minor_contact" = $11, "minor_defiance" = $12, "minor_disruption" = $13, "minor_property" = $14, "minor_dress" = $15, "minor_technology" = $16, "minor_tardy" = $17, "major_language" = $18, "major_aggression" = $19, "major_disrespect" = $20, "major_habitual_disruption" = $21, "major_dishonesty" = $22, "major_harrassment" = $23, "major_tardies" = $24, "major_vandalism" = $25, "major_theft" = $26, "major_dress_code" = $27, "major_drugs" = $28, "major_weapons" = $29, "antecedent" = $30, "behavior_description" = $31, "due_process" = $32, "admin_time_office" = $33, "admin_loss_privilege" = $34, "admin_conference_student" = $35, "admin_parent_contact" = $36, "admin_detention" = $37, "admin_service" = $38, "admin_individual_instruction" = $39, "admin_counselor" = $40, "admin_in_school_suspension" = $41, "admin_suspension" = $42, "admin_expulsion" = $43, "admin_other" = $44, "event_date" = $45, "updated_at" = $46 WHERE "behaviors"."id" = $47
---
	def update
		@behavior = Behavior.find(params[:id])
		if @behavior.update(behavior_params)