app/controllers/parents_controller.rb

SELECT "parents".* FROM "parents"
---
	def index
		@parents = Parent.all

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@parent = Parent.find(params[:id])

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@parent = Parent.find(params[:id])

INSERT INTO "parents" ("fName", "lName", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fName", "Macey"], ["lName", "Rye"], ["created_at", "2018-11-10 22:27:53.380863"], ["updated_at", "2018-11-10 22:27:53.380863"]]
---
	def create
		@parent = Parent.new(parent_params)

		if @parent.save

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "parents" SET "fName" = $1, "updated_at" = $2 WHERE "parents"."id" = $3  [["fName", "Pacey"], ["updated_at", "2018-11-10 22:28:03.104503"], ["id", 1]]
---
	def update
		@parent = Parent.find(params[:id])
		if @parent.update(parent_params)

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "parents" WHERE "parents"."id" = $1  [["id", 2]]
---
	def destroy
	  @parent = Parent.find(params[:id])
	  @parent.destroy