app/controllers/staffs_controller.rb

	def index
		@staffs = Staff.all
---
SELECT "staffs".* FROM "staffs"

	def show
		@staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def edit
		@staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@staff = Staff.new(staff_params)

		if @staff.save
---
INSERT INTO "staffs" ("fName", "lName", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fName", "Casey"], ["lName", "Pye"], ["created_at", "2018-11-10 23:32:28.383575"], ["updated_at", "2018-11-10 23:32:28.383575"]]

	def update
		@staff = Staff.find(params[:id])
		if @staff.update(staff_params)
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "staffs" SET "fName" = $1, "lName" = $2, "updated_at" = $3 WHERE "staffs"."id" = $4  [["fName", "Masey"], ["lName", "Rye"], ["updated_at", "2018-11-10 23:32:37.399598"], ["id", 1]]