app/controllers/students_controller.rb

	def create
		@student = Student.new(student_params)

		if @student.save
---
INSERT INTO "students" ("fName", "lName", "grade", "homeroom_teacher", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["fName", "Ron"], ["lName", "Weasly"], ["grade", 6], ["homeroom_teacher", 15], ["created_at", "2018-11-24 02:22:28.398126"], ["updated_at", "2018-11-24 02:22:28.398126"]]

	def update
		@student = Student.find(params[:id])
		if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "lName" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["lName", "McDew"], ["updated_at", "2018-11-10 23:10:16.359746"], ["id", 1]]