app/models/behavior.rb

	def create_student_name
		# check if there is a student id
		if student_id
			# is it valid?
			begin
				Student.find(student_id).full_name_last
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def create_staff_name
		# check if there is a student id
		if staff_id
			Staff.find(staff_id).full_name_last
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]